#Даны два натуральных числа m и n. Напишите программу, которая сокращает дробь  m/n и выводит ее.
from fractions import Fraction
print (Fraction(int(input()),int(input())))