# Назовем умножением строки на число запись в формате n(string),
# где n — неотрицательное целое число, а string — строка, которая должна быть записана n раз.
# Раскрытием умножения будем считать развернутый вариант данной записи,
# например, строка ti2(Be)3(Ge) после раскрытия в ней всех умножений будет иметь вид tiBeBeGeGeGe.
#
# Напишите программу, которая раскрывает все умножения в тексте и выводит полученный результат.
#
# Формат входных данных
# На вход программе подается одна строка, содержащая строчные латинские буквы, числа и скобки.
#
# Формат выходных данных
# Программа должна вывести строку, в которой раскрыты все умножения с учетом приоритетности операций.
#
# Примечание 1. Гарантируется, что умножение в подаваемой строке всегда записано корректно, то есть строго в формате n(string).
# Записи вида 4(2), 3q, (fg)7 не корректны.
#
# Примечание 2. Рассмотрим третий тест.
# С учетом приоритетности операций сначала раскрываем умножение 2(a) и получаем промежуточную строку bbbb10(aa)bbb,
# далее раскрываем умножение 10(aa) и получаем конечный результат в виде строки bbbbaaaaaaaaaaaaaaaaaaaabbb.
#
# Примечание 3. Строка, в которой раскрыты все умножения, всегда содержит исключительно строчные латинские буквы.
#
# Примечание 4. Максимальная длина результирующей строки не превосходит 450000 символов.

import re

s = input()

def func2(match_obj):
    s = match_obj.group(0)   # строка совпадения
    s = int(s[:s.index('(')]) * s[s.index('(')+1:-1]
    return s


def func(s):
    if '(' not in s:
        return s
    else:
        s = re.sub(r'\d+\(\w+\)',func2,s)
        return func(s)

print(func(s))


# Sample Input 1:
# hello3(world)hi

# Sample Output 1:
# helloworldworldworldhi

# Sample Input 2:
#
# 0(s)he0(be)lie0(ve)d
# Sample Output 2:
#
# helied
# Sample Input 3:
#
# bbbb10(2(a))bbb
# Sample Output 3:
#
# bbbbaaaaaaaaaaaaaaaaaaaabbb
# Sample Input 4:
#
# hi2(priv3(d3(i)dd)qq)b0(pr)qwqdd
# Sample Output 4:
#
# hiprivdiiidddiiidddiiiddqqprivdiiidddiiidddiiiddqqbqwqdd
# Sample Input 5:
#
# hhhhhh
# Sample Output 5:
#
# hhhhhh